Project/Toir.Adaptation/src/DataProcessors/торо_РабочееМестоДиспетчера/торо_РабочееМестоДиспетчера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_РабочееМестоДиспетчера</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/DataProcessors/торо_РабочееМестоДиспетчера/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз 1] Куст 17.03.2020
	ДобавитьНовыеЭлементы();
	// гкс- [Релиз 1] Куст 17.03.2020
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
&ИзменениеИКонтроль("ЖурналДефектов")
Процедура Расш_гкс_ЖурналДефектов(Команда)
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("НачПериода", НачалоГода(Дата));
	ПараметрыОтбора.Вставить("КонПериода", КонецГода(Дата));
	ПараметрыОтбора.Вставить("ПодразделениеДляДок", ПодразделениеДляДок);
	ПараметрыОтбора.Вставить("Организация", Организация);
	#Удаление
	ПараметрыОтбора.Вставить("ОР", ТекущийОР);
	#КонецУдаления
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	ПараметрыОтбора.Вставить("ОР", ОтказавшийЭлемент);
	ПараметрыОтбора.Вставить("гкс_ОРОтказавшийЭлемент", Истина);
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	
	допПараметры = Новый Структура();
	допПараметры.Вставить("ПараметрыОтбора", ПараметрыОтбора);

	ОткрытьФорму("Документ.торо_ВыявленныеДефекты.Форма.ФормаЖурналаДефектов", допПараметры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервере
Процедура ДобавитьНовыеЭлементы()
	Элементы.ТиповойДефект.Видимость = Ложь;
	Элементы.ПричинаДефекта.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ВидДефекта.Видимость = Ложь;
	Элементы.ПричинаДефекта.Видимость = Ложь;
	Элементы.Переместить(Элементы.УсловияВыявленияДефекта, Элементы.ДефектыЛевая);
	
	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_СдвигЧП", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(2,0))));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_Влияние",
		Новый ОписаниеТипов("ПеречислениеСсылка.гкс_Влияние")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_СимптомДефекта",
		Новый ОписаниеТипов("СправочникСсылка.гкс_СимптомыДефектов")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_НаправлениеНаУстранение",
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)),, 
		НСтр("ru='Комментарий к направлению на устранение';
		|en='Comment on the direction for elimination'")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ОписаниеДефекта",
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)),, 
		НСтр("ru='Описание дефекта';en='Defect description';es='El defecto la descripción'"))); 
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ДефектОформленПоТАГ",
		Новый ОписаниеТипов("Булево"),, 
		"Дефект выявлен по ТАГ"));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_НомерТАГ",
		Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)),, 
		"Номер ТАГ"));
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	ИзменитьРеквизиты(НовыеРеквизиты);
	

	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	ДатаСервера = ТекущаяДата();
	ДатаКлиента = ТекущаяДатаСеанса();
	Если Секунда(ДатаСервера) >= Секунда(ДатаКлиента) Тогда 
		Разница = Час(ДатаКлиента) - Час(ДатаСервера) ;
	Иначе
		Разница = Час(ДатаКлиента) - Час(ДатаСервера) + 1;
	КонецЕсли;
	ЭтаФорма["гкс_СдвигЧП"] = Разница;
	// гкс- [Часовые пояса] Куст 14.04.2020
	
	НЭлем = Элементы.Добавить("гкс_Влияние",Тип("ПолеФормы"), Элементы.ДефектыЛевая);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_Влияние";
	НЭлем.Заголовок = НСтр("ru='Влияние';en='Impact'");
	// гкс+ [Релиз 1] Куст 05.11.2020
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	// гкс- [Релиз 1] Куст 05.11.2020
	
	НЭлем = Элементы.Добавить("гкс_СимптомДефекта", Тип("ПолеФормы"), Элементы.ДефектыЛевая);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_СимптомДефекта";
	НЭлем.Заголовок = НСтр("ru='Симптом дефекта';en='Symptom defect'");
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	
	НЭлем = Элементы.Добавить("гкс_ОписаниеДефекта", Тип("ПолеФормы"), Элементы.ГруппаНижняя);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ОписаниеДефекта";
	НЭлем.Ширина = 101;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	
	НЭлем = Элементы.Добавить("гкс_НаправлениеНаУстранение", Тип("ПолеФормы"), Элементы.ГруппаНижняя);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_НаправлениеНаУстранение";
	НЭлем.Ширина = 101; 
	
	Элементы.ОписаниеДефекта.Видимость = Ложь;
	
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	НЭлем = Элементы.Вставить("гкс_НомерТАГ", Тип("ПолеФормы"), Элементы.ГруппаНижняя, Элементы.Инициатор);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_НомерТАГ"; 
	НЭлем.Маска = "99999999999999999999";
	НЭлем.Доступность = Ложь; 
	
	НЭлем = Элементы.Вставить("гкс_ДефектОформленПоТАГ", Тип("ПолеФормы"), Элементы.ГруппаНижняя, Элементы.гкс_НомерТАГ);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "гкс_ДефектОформленПоТАГ";
	НЭлем.УстановитьДействие("ПриИзменении", "Расш_гкс_ПриИзмененииДефектОформленПоТАГ");
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	
	
	НКом = Команды.Добавить("гкс_ОткрытьПрисоединенныеФайлы");
	НКом.Действие = "ОткрытьПрисоединенныеФайлы";
	
	НЭлем = Элементы.Добавить("гкс_ГруппаДокНовый", Тип("ГруппаФормы"));
	НЭлем.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НЭлем.ОтображатьЗаголовок = Ложь;
	НЭлем.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Элементы.Переместить(Элементы["гкс_ГруппаДокНовый"], Элементы.ГруппаНижняя,Элементы.НовыйДок);
	Элементы.Переместить(Элементы.НовыйДок, Элементы["гкс_ГруппаДокНовый"]);
	
	НКноп = Элементы.Добавить("гкс_ОткрытьПрисоединенныеФайлы", Тип("КнопкаФормы"), Элементы["гкс_ГруппаДокНовый"]);
	НКноп.ИмяКоманды = "гкс_ОткрытьПрисоединенныеФайлы";
	НКноп.Заголовок = НСтр("ru='Открыть присоединенные файлы';en='Open attached files'");
	НКноп.Отображение = ОтображениеКнопки.Картинка;
	НКноп.Картинка = БиблиотекаКартинок.Скрепка;
	
	Элементы.ДефектыЛевая.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	Элементы.Дефекты.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;	
	
	// гкс+ [8078] Тарасов 09.10.2020
	Элементы.КритичностьДефекта.АвтоОтметкаНезаполненного = Истина;
	// гкс- [8078] Тарасов 09.10.2020
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

&НаКлиенте
Процедура Расш_гкс_ПриИзмененииДефектОформленПоТАГ()
	
	ЭтотОбъект["гкс_НомерТАГ"] = ""; 
	Элементы.гкс_НомерТАГ.АвтоОтметкаНезаполненного = ЭтотОбъект["гкс_ДефектОформленПоТАГ"];
	Элементы.гкс_НомерТАГ.Доступность = ЭтотОбъект["гкс_ДефектОформленПоТАГ"];
	
КонецПроцедуры	
	
// гкс+ [Релиз 1] Куст 17.03.2020
&НаКлиенте
Процедура ОткрытьПрисоединенныеФайлы(Команда)
	Если ЗначениеЗаполнено(НовыйДок) Тогда 
	//Зозуля TOIR20-470+ изменено:
		//ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("ВладелецФайла",  НовыйДок);
		//ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
		//
		//ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
		//             ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормы = Новый Структура("ВнешнийОбъект", НовыйДок);
	ОткрытьФорму(
		"Обработка.ИнтеграцияС1СДокументооборот.Форма.Документооборот", 
		ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Зозуля TOIR20-470-
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервереБезКонтекста
Функция ЭтоФМ(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка
		|	И торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|	И торо_ОбъектыРемонта.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);          
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
// гкс- [Релиз 1] Куст 17.03.2020

// гкс+ [Релиз 1] Куст 17.03.2020
&НаСервереБезКонтекста
Функция НайтиФМИЗаполнитьДанныеОРНаСервере(Ссылка)
	
	ТекущееФункциональноеФесто = гкс_ПроверкаФункциональныхМест.НайтиФМ(Ссылка);
	Если ЗначениеЗаполнено(ТекущееФункциональноеФесто) И НЕ Ссылка = ТекущееФункциональноеФесто Тогда 
		Ссылка = ТекущееФункциональноеФесто;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОбъектыРемонта.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	торо_ОбъектыРемонта.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	торо_ОбъектыРемонта.ТехНомер КАК ТехНомер,
	               |	торо_ОбъектыРемонта.АдресМестонахождения КАК АдресМестонахождения,
	               |	торо_ОбъектыРемонта.Наименование КАК Наименование,
	               |	торо_ОбъектыРемонта.Подразделение КАК Подразделение,
	               |	торо_ОбъектыРемонта.ПодразделениеИсполнитель КАК ПодразделениеИсполнитель,
	               |	торо_ОбъектыРемонта.Направление КАК Направление,
	               |	торо_ОбъектыРемонта.ЭтоГруппа КАК ЭтоГруппа,
	               |	торо_ОбъектыРемонта.ВнешнийОбъект КАК ВнешнийОбъект,
	               |	торо_ОбъектыРемонта.Контрагент КАК Контрагент,
				   |	торо_ОбъектыРемонта.ТипОбъекта = 
				   |	Значение(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
				   |	торо_ОбъектыРемонта.Ссылка
	               |ИЗ
	               |	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	               |ГДЕ
	               |	торо_ОбъектыРемонта.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	стрВозврата = Новый Структура("ИнвентарныйНомер,ЗаводскойНомер,ТехНомер,АдресМестонахождения,Наименование,"
		+ "Подразделение,ПодразделениеИсполнитель,Направление,ЭтоГруппа,ВнешнийОбъект,Контрагент,ЭтоФМ,Ссылка");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат стрВозврата;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(стрВозврата, Выборка);
	Возврат стрВозврата;
	
КонецФункции
// гкс- [Релиз 1] Куст 17.03.2020

&НаКлиенте
&ИзменениеИКонтроль("ОтказавшийЭлементОбработкаВыбора")
Процедура Расш_гкс_ОтказавшийЭлементОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	#Вставка
	Если ЭтоФМ(ВыбранноеЗначение) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Отказавшим элементом не должно быть функциональое место!'");
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	#КонецВставки
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		струк = ЗаполнитьДанныеОРНаСервере(ВыбранноеЗначение);
		Направление = струк.Направление;
	Иначе
		Направление = ПредопределенноеЗначение("Справочник.торо_НаправленияОбъектовРемонтныхРабот.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьДанныеОРНаКлиенте")
Процедура Расш_гкс_ЗаполнитьДанныеОРНаКлиенте1(ТекущиеДанные)

	Если ТекущиеДанные <> Неопределено Тогда

		ТекущийОР = ТекущиеДанные.Ссылка;
		#Удаление
		стрВозврата = ЗаполнитьДанныеОРНаСервере(ТекущийОР);
		#КонецУдаления
		#Вставка
		стрВозврата = НайтиФМИЗаполнитьДанныеОРНаСервере(ТекущийОР);
		#КонецВставки

		ВходитВСостав = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ТекущийОР, ТекСтруктураИерархии);

		Если стрВозврата.Контрагент <> Неопределено И ЗначениеЗаполнено(стрВозврата.Контрагент) Тогда
			Элементы.Подразделение.Видимость = Ложь;
			Элементы.Контрагент.Видимость = Истина;
		Иначе
			Элементы.Подразделение.Видимость = Истина;
			Элементы.Контрагент.Видимость = Ложь;
		КонецЕсли;

		Подразделение = стрВозврата.Подразделение;
		Наименование = стрВозврата.Наименование;
		ОбъектРемонта = стрВозврата.Ссылка;
		Местонахождение = стрВозврата.АдресМестонахождения;
		ИнвентарныйНомер = стрВозврата.ИнвентарныйНомер;
		ЗаводскойНомер = стрВозврата.ЗаводскойНомер;
		ТехнологичейскийНомер = стрВозврата.ТехНомер;
		ПодразделениеИсполнитель = стрВозврата.ПодразделениеИсполнитель;
		Контрагент = стрВозврата.Контрагент;
		Направление = стрВозврата.Направление;

		#Удаление
		Если стрВозврата.ЭтоГруппа <> Неопределено И стрВозврата.ЭтоГруппа = Ложь Тогда
		#КонецУдаления
		#Вставка
		Если (стрВозврата.ЭтоГруппа <> Неопределено И стрВозврата.ЭтоГруппа = Ложь)
			И Не стрВозврата.ЭтоФМ = Истина Тогда
		#КонецВставки
			ОтказавшийЭлемент = ТекущиеДанные.Ссылка;
		Иначе
			ОтказавшийЭлемент = Неопределено;
		КонецЕсли;

		Дата = ТекущаяДата();
		ДатаОбнаружения = ТекущаяДата();

		#Удаление
		КонтактноеЛицо = Неопределено;
		#КонецУдаления
		ТиповойДефект = Неопределено;
		КритичностьДефекта = Неопределено;
		ОписаниеДефекта = Неопределено;
		ВидДефекта = Неопределено;
		ПричинаДефекта = Неопределено;
		УсловияВыявленияДефекта = Неопределено;
		#Вставка
		// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	    ЭтотОбъект["гкс_ДефектОформленПоТАГ"] = Ложь;
		ЭтотОбъект["гкс_НомерТАГ"] = "";
		Элементы.гкс_НомерТАГ.Доступность = Ложь;
		// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.	
		ЭтотОбъект["гкс_ОписаниеДефекта"] = Неопределено;
		#КонецВставки

		Статус = "";
		Номер = "";
		НовыйДок = Неопределено;
	Иначе 
		Статус = "";
		Номер = "";
		НовыйДок = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоТИповомуДефекту")
Процедура Расш_гкс_ЗаполнитьПоТИповомуДефекту1()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта.Причина КАК Причина,
	|	торо_ТиповыеДефектыОборудования.ВидДефекта КАК ВидДефекта,
	|	торо_ТиповыеДефектыОборудования.КритичностьДефекта КАК КритичностьДефекта,
	|	торо_ТиповыеДефектыОборудования.ОписаниеДефекта КАК ОписаниеДефекта,
	|	торо_ТиповыеДефектыОборудования.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
	|	торо_ТиповыеДефектыОборудования.ПоследствиеДефекта КАК ПоследствиеДефекта
	|ИЗ
	|	Справочник.торо_ТиповыеДефектыОборудования КАК торо_ТиповыеДефектыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеДефектыОборудования.ПричиныВозникновенияДефекта КАК торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта
	|		ПО (торо_ТиповыеДефектыОборудованияПричиныВозникновенияДефекта.Ссылка = торо_ТиповыеДефектыОборудования.Ссылка)
	|ГДЕ
	|	торо_ТиповыеДефектыОборудования.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ТиповойДефект);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда возврат; КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	ВидДефекта = Выборка.ВидДефекта;
	ПричинаДефекта = Выборка.Причина;
	КритичностьДефекта = Выборка.КритичностьДефекта;
	ОписаниеДефекта = Выборка.ОписаниеДефекта;
	ПоследствиеДефекта = Выборка.ПоследствиеДефекта;
	НаправлениеНаУстранение = Выборка.НаправлениеНаУстранение;
	#Вставка
	ЭтотОбъект["гкс_НаправлениеНаУстранение"] = Выборка.НаправлениеНаУстранение;
	ЭтотОбъект["гкс_ОписаниеДефекта"] = Выборка.ОписаниеДефекта;
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПроверитьЗаполнениеОбязательныхРеквизитов")
Функция Расш_гкс_ПроверитьЗаполнениеОбязательныхРеквизитов1()

	Ошибка = Ложь;

	масОшибок = Новый Массив;

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Организация");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПодразделениеДляДок) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Подразделение");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(УсловияВыявленияДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дефект выявлен в процессе");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дата");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаОбнаружения) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Дата обнаружения");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ОтказавшийЭлемент) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Отказавший элемент");
	КонецЕсли;
	#Удаление
	Если Не ЗначениеЗаполнено(ВидДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Вид дефекта");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПричинаДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Причина дефекта");
	КонецЕсли;
	#КонецУдаления
	#Вставка
	Если Не ЗначениеЗаполнено(ЭтотОбъект["гкс_СимптомДефекта"]) Тогда
		Ошибка = Истина;
		масОшибок.Добавить(НСтр("ru='Симптом дефекта';en='Symptom defect'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЭтотОбъект["гкс_ОписаниеДефекта"]) Тогда
		Ошибка = Истина;
		масОшибок.Добавить(НСтр("ru='Описание дефекта';en='Defect description';es='El defecto la descripción'"));
	КонецЕсли;
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{	
	Если ЭтотОбъект["гкс_ДефектОформленПоТАГ"] И НЕ ЗначениеЗаполнено(ЭтотОбъект["гкс_НомерТАГ"]) Тогда
		Ошибка = Истина;
		масОшибок.Добавить("Номер ТАГ");
	КонецЕсли;
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	
	// гкс+ [8078] Тарасов 09.10.2020
	Если Не ЗначениеЗаполнено(КритичностьДефекта) Тогда
		Ошибка = Истина;
		масОшибок.Добавить(НСтр("ru='Критичность дефекта';en='Defect criticality'"));
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	// гкс+ [Релиз 1] Куст 05.11.2020  
	Если Не ЗначениеЗаполнено(ЭтотОбъект["гкс_Влияние"]) Тогда
		Ошибка = Истина;
		масОшибок.Добавить(НСтр("ru='Влияние';en='Impact'"));
	КонецЕсли;
	//
	Если Не ЗначениеЗаполнено(ЭтотОбъект["ОбъектРемонта"]) Тогда
		Ошибка = Истина;
		масОшибок.Добавить(НСтр("ru='ФМ';en='FP'"));
	КонецЕсли;
	// гкс- [Релиз 1] Куст 05.11.2020
	#КонецВставки

	Для каждого текСтрока из масОшибок Цикл
		#Удаление
		ШаблонСообщения = НСтр("ru = 'Поле <%1> не заполнено! Документ не будет создан.'");
		#КонецУдаления
		#Вставка
		ШаблонСообщения = НСтр("es='¡Campo <%1> no es rellenado! El documento no será creado.';
			|ru='Поле <%1> не заполнено! Документ не будет создан.';
			|en='Field <%1> is empty! The document will not be created.'");
		#КонецВставки
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрока);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;

	Возврат Ошибка;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура Расш_гкс_ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора <> Неопределено Тогда
		ТиповойДефект = ВыбранноеЗначение.Дефект;
		ВидДефекта = ВыбранноеЗначение.ВидДефекта;
		КритичностьДефекта = ВыбранноеЗначение.КритичностьДефекта;
		ПричинаДефекта = ВыбранноеЗначение.ПричинаДефекта;
		ОписаниеДефекта = ВыбранноеЗначение.ДефектОписание;
		#Вставка
		ЭтотОбъект["гкс_ОписаниеДефекта"] = ВыбранноеЗначение.ДефектОписание;
		#КонецВставки
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗарегистрироватьДефект")
Процедура Расш_гкс_ЗарегистрироватьДефект(Команда)

	Если ПроверитьЗаполнениеОбязательныхРеквизитов() Тогда
		Возврат;
	КонецЕсли;

	Если Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаДерево Тогда
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
		Если ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.торо_СтруктурыОР") Тогда
			#Удаление
			ТекстСообщения = НСтр("ru = 'В качестве объекта ремонта нельзя выбрать вид иерархии объектов ремонта.'");
			#КонецУдаления
			#Вставка
			ТекстСообщения = НСтр("es='En calidad del objeto de la reparación no es posible escoger el tipo de la jerarquía"
				+ " de los objetos de la reparación.';ru='В качестве объекта ремонта нельзя выбрать вид иерархии объектов"
				+ " ремонта.';en='You cannot select the type of hierarchy of repair objects as a repair object.'");
			#КонецВставки
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли; 

	Если ТекДанные.ЭтоГруппа = Истина Тогда
		#Удаление
		ТекстСообщения = НСтр("ru = 'В качестве объекта ремонта нельзя выбрать группу.'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='En calidad del objeto de la reparación no es posible escoger el grupo.'
			|;ru='В качестве объекта ремонта нельзя выбрать группу.';
			|en='You cannot select a group as a repair item.'");
		#КонецВставки
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	

	Результат = СоздатьДокументВыявленныйДефект();
	Если ЗначениеЗаполнено(Результат) тогда
		Номер = Результат;
		Статус = "Зарегистрирован";

		Если ФОНапоминатьЗафиксироватьПростой И ФОУчетСостоянияОборудования Тогда
			#Удаление
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗарегистрироватьДефектЗавершение", ЭтотОбъект, Неопределено), НСтр("ru = 'Зафиксировать фактический простой объектов?'"), РежимДиалогаВопрос.ДаНет);
			#КонецУдаления
			#Вставка
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗарегистрироватьДефектЗавершение", ЭтотОбъект, Неопределено),
				НСтр("es='¿Fijar las horas muertas reales de los objetos?';ru='Зафиксировать фактический простой объектов?';
				|en='Lock actual downtime to objects?'"), РежимДиалогаВопрос.ДаНет);
			#КонецВставки
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СоздатьДокументВыявленныйДефект")
Функция Расш_гкс_СоздатьДокументВыявленныйДефект1()

	Если ЗначениеЗаполнено(Номер) и Документы.торо_ВыявленныеДефекты.НайтиПоНомеру(Номер, Дата) <> Неопределено Тогда
		#Удаление
		ТекстСообщения = НСтр("ru = 'Документ с таким номером уже существует в этом периоде! Документ не был создан.'");
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='¡El documento con tal número existe ya en este período! El documento no era creado.'
			|;ru='Документ с таким номером уже существует в этом периоде! Документ не был создан.';
			|en='A document with this number already exists in this period! The document was not created.'");
		#КонецВставки
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;

	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты;
	СогласованиеИспользуется = торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов(ВидДокумента);

	СтруктураЗаполнения = Новый Структура;
	#Вставка
	Если Не ЭтаФорма["гкс_СдвигЧП"] = 0 Тогда 
		СтруктураЗаполнения.Вставить("Дата", Дата - (ЭтаФорма["гкс_СдвигЧП"] * 3600));
		СтруктураЗаполнения.Вставить("ДатаОбнаружения", ДатаОбнаружения - (ЭтаФорма["гкс_СдвигЧП"] * 3600));	
	Иначе
	#КонецВставки
	СтруктураЗаполнения.Вставить("Дата", Дата);
	СтруктураЗаполнения.Вставить("ДатаОбнаружения", ДатаОбнаружения);
	#Вставка
	КонецЕсли;
	#КонецВставки
	Если ЗначениеЗаполнено(Номер) Тогда 
		СтруктураЗаполнения.Вставить("Номер", Номер);
	КонецЕсли;

	СтруктураЗаполнения.Вставить("Инициатор", Инициатор);
	СтруктураЗаполнения.Вставить("КонтактноеЛицоИнициатора", КонтактноеЛицо);
	СтруктураЗаполнения.Вставить("ДефектВыявленВПроцессе", УсловияВыявленияДефекта);
	СтруктураЗаполнения.Вставить("Организация", Организация);
	СтруктураЗаполнения.Вставить("Подразделение", ПодразделениеДляДок);
	СтруктураЗаполнения.Вставить("ОбъектРемонта", ОбъектРемонта);
	СтруктураЗаполнения.Вставить("ПодразделениеИсполнитель", ПодразделениеИсполнитель);
	#Вставка
	СтруктураЗаполнения.Вставить("гкс_Влияние", ЭтотОбъект["гкс_Влияние"]);
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	СтруктураЗаполнения.Вставить("гкс_ДефектОформленПоТАГ", ЭтотОбъект["гкс_ДефектОформленПоТАГ"]);
	СтруктураЗаполнения.Вставить("гкс_НомерТАГ", ЭтотОбъект["гкс_НомерТАГ"]);
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	#КонецВставки

	СтруктураСтрокиТЧ = Новый Структура;
	СтруктураСтрокиТЧ.Вставить("ОтказавшийЭлемент", ОтказавшийЭлемент);
	СтруктураСтрокиТЧ.Вставить("ОбъектРемонта", ОбъектРемонта);
	СтруктураСтрокиТЧ.Вставить("ТиповойДефект", ТиповойДефект);
	СтруктураСтрокиТЧ.Вставить("ВидДефекта", ВидДефекта);
	СтруктураСтрокиТЧ.Вставить("ДефектПричина", ПричинаДефекта);
	СтруктураСтрокиТЧ.Вставить("КритичностьДефекта", КритичностьДефекта);
	#Удаление
	СтруктураСтрокиТЧ.Вставить("ДефектОписание", ОписаниеДефекта);
	#КонецУдаления
	СтруктураСтрокиТЧ.Вставить("ПоследствияДефекта", ПоследствиеДефекта);
	#Удаление
	СтруктураСтрокиТЧ.Вставить("НаправлениеНаУстранение", НаправлениеНаУстранение);
	#КонецУдаления
	СтруктураСтрокиТЧ.Вставить("ПодразделениеИсполнитель", ПодразделениеИсполнитель);
	#Вставка
	СтруктураСтрокиТЧ.Вставить("ДефектОписание", ЭтотОбъект["гкс_ОписаниеДефекта"]);
	СтруктураСтрокиТЧ.Вставить("гкс_СимптомДефекта", ЭтаФорма["гкс_СимптомДефекта"]);
	СтруктураСтрокиТЧ.Вставить("НаправлениеНаУстранение", ЭтотОбъект["гкс_НаправлениеНаУстранение"]);
	#КонецВставки

	МассивСтрокТЧ = Новый Массив;
	МассивСтрокТЧ.Добавить(СтруктураСтрокиТЧ);

	СтруктураЗаполнения.Вставить("МассивСтрокТЧ", МассивСтрокТЧ);

	докОбъект = Документы.торо_ВыявленныеДефекты.СоздатьДокумент();
	докОбъект.Заполнить(СтруктураЗаполнения);
	
	#Вставка
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	докОбъект.гкс_ДефектОформленПоТАГ = СтруктураЗаполнения.гкс_ДефектОформленПоТАГ;
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	
	// Гкс+[TOIR20-577] Зозуля А.В. от 22.04.2025. Добавлено:{
	СписокДефектов = докОбъект.СписокДефектов;
	Если СписокДефектов.Количество() > 0 Тогда
		ДанныеТабличнойЧасти = Новый ТаблицаЗначений;
		ДанныеТабличнойЧасти.Колонки.Добавить("ОтказавшийЭлемент", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта")); 
		ДанныеТабличнойЧасти.Колонки.Добавить("КритичностьДефекта", Новый ОписаниеТипов("СправочникСсылка.торо_КритичностьДефекта"));
		Для Каждого ТекСтрока Из СписокДефектов Цикл
			НоваяСтрока = ДанныеТабличнойЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;	
		
		Менеджер = Документы.торо_ВыявленныеДефекты;
		СтруктураОтвета = Менеджер.гкс_МаксимальнаяСрочностьВоздействияИКачественнаяОценка(ДанныеТабличнойЧасти);
		докОбъект.гкс_СрочностьВоздействия = СтруктураОтвета.СрочностьВоздействия;
		докОбъект.гкс_КачественнаяОценка = СтруктураОтвета.КачественнаяОценка;
	КонецЕсли;	
	// } Гкс-[TOIR20-577] Зозуля А.В. от 22.04.2025.
	#КонецВставки

	Попытка
		Если СогласованиеИспользуется Тогда
			докОбъект.Записать(РежимЗаписиДокумента.Запись);
		Иначе 
			докОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		#Удаление
		ТекстСообщения = НСтр("ru = 'При записи документа произошла ошибка: '") + ОписаниеОшибки();
		#КонецУдаления
		#Вставка
		ТекстСообщения = НСтр("es='A la anotación del documento había una falta: '
			|;ru='При записи документа произошла ошибка: ';
			|en='An error occurred while writing the document: '") + ОписаниеОшибки();
		#КонецВставки
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		возврат Неопределено;
	КонецПопытки;

	НовыйДок = докОбъект.Ссылка;
	Возврат докОбъект.Номер;	

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОчиститьПоля")
Процедура Расш_гкс_ОчиститьПоля1()

	НовыйДок = Неопределено;	

	Дата = ТекущаяДата();
	ДатаОбнаружения = ТекущаяДата();

	ПодразделениеИсполнитель = ПолучитьПодразделениеИсполнительОРНаСервере(ОтказавшийЭлемент);
	#Удаление
	//Инициатор = Неопределено;
	КонтактноеЛицо = Неопределено; 
	#КонецУдаления
	ТиповойДефект = Неопределено;
	КритичностьДефекта = Неопределено;
	ВидДефекта = Неопределено;
	ПричинаДефекта = Неопределено;
	УсловияВыявленияДефекта = Неопределено;
	ОписаниеДефекта = "";
	#Вставка
	ЭтотОбъект["гкс_ОписаниеДефекта"] = "";
	ЭтотОбъект["гкс_СимптомДефекта"] = Неопределено;
	ЭтотОбъект["гкс_НаправлениеНаУстранение"] = "";
	// Гкс+[TOIR20-511] Вялых Д.А. от 23.01.2025. Добавлено:{
	ЭтотОбъект["гкс_ДефектОформленПоТАГ"] = Ложь;
	ЭтотОбъект["гкс_НомерТАГ"] = "";
	Элементы.гкс_НомерТАГ.Доступность = Ложь;
	// } Гкс-[TOIR20-511] Вялых Д.А. от 23.01.2025.
	#КонецВставки

	Статус = "";
	Номер = "";

	ЗаполнитьРеквизитыШапкиПоУмолчанию();

КонецПроцедуры

#КонецОбласти
